# Pandas py practice
Author: Joe Acosta
Date: 07/18/2025

Day 1: Creating yaml file to automatically create Conda env, learn how to use Conda and how to download MiniConda

Day 2: Start Course and Practice Recreating Conda env

Day 3: Reviewed Pandas info -> Pandas is built on NumPy and uses MatPlotLib to visualize the data

List the imports required to get the titanic dataset and load the dataset

In [1]:
# Imports
import pandas as pd
import seaborn as sns

In [2]:
# Gets the titanic dataset from the sns dataset
titanic = sns.load_dataset('titanic')

Check the data types for the dataset and its columns

In [3]:
# Gets the data type of the titanic dataset to verify if it's pandas dfS
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [4]:
# get the series data types
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

Get the DataFrame information

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

How many people were on the titanic?

In [6]:
titanic.shape # or len(titanic)

(891, 15)

Create a df of all adult males that were alone

In [45]:
alone_males=titanic.loc[(titanic.alone == True) & (titanic.adult_male == True)]

How many alone males were in first class

In [47]:
(alone_males['class'] == 'First').sum()

np.int64(75)

What is the average price for alone males, max, min?

In [48]:
alone_males.fare.describe()

count    410.000000
mean      16.708299
std       32.003090
min        0.000000
25%        7.750000
50%        8.050000
75%       13.500000
max      512.329200
Name: fare, dtype: float64

Which alone males paid more than the average titanic price?

In [ ]:
alone_males.loc[alone_males.fare > titanic.fare.mean()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
55,1,1,male,NaN,0,0,35.5000,S,First,man,True,C,Southampton,yes,True
72,0,2,male,21.0,0,0,73.5000,S,Second,man,True,NaN,Southampton,no,True
74,1,3,male,32.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
83,0,1,male,28.0,0,0,47.1000,S,First,man,True,NaN,Southampton,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
110,0,1,male,47.0,0,0,52.0000,S,First,man,True,C,Southampton,no,True
139,0,1,male,24.0,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True
169,0,3,male,28.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,no,True
170,0,1,male,61.0,0,0,33.5000,S,First,man,True,B,Southampton,no,True
185,0,1,male,NaN,0,0,50.0000,S,First,man,True,A,Southampton,no,True
339,0,1,male,45.0,0,0,35.5000,S,First,man,True,NaN,Southampton,no,True
351,0,1,male,NaN,0,0,35.0000,S,First,man,True,C,Southampton,no,True
373,0,1,male,22.0,0,0,135.6333,C,First,man,True,NaN,Cherbourg,no,True
385,0,2,male,18.0,0,0,73.5000,S,Second,man,True,NaN,Southampton,no,True
462,0,1,male,47.0,0,0,38.5000,S,First,man,True,E,Southampton,no,True
475,0,1,male,NaN,0,0,52.0000,S,First,man,True,A,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
509,1,3,male,26.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
515,0,1,male,47.0,0,0,34.0208,S,First,man,True,D,Southampton,no,True
527,0,1,male,NaN,0,0,221.7792,S,First,man,True,C,Southampton,no,True
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True
583,0,1,male,36.0,0,0,40.1250,C,First,man,True,A,Cherbourg,no,True
602,0,1,male,NaN,0,0,42.4000,S,First,man,True,NaN,Southampton,no,True
625,0,1,male,61.0,0,0,32.3208,S,First,man,True,D,Southampton,no,True
643,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
647,1,1,male,56.0,0,0,35.5000,C,First,man,True,A,Cherbourg,yes,True
681,1,1,male,27.0,0,0,76.7292,C,First,man,True,D,Cherbourg,yes,True
692,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True
789,0,1,male,46.0,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True
826,0,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,no,True
838,1,3,male,32.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True

What are the different columns?

In [7]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

Get the Top 10 and Bottom 5

In [8]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [9]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

Get 5 random passangers

In [10]:
titanic.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
360,0,3,male,40.0,1,4,27.9000,S,Third,man,True,NaN,Southampton,no,False
322,1,2,female,30.0,0,0,12.3500,Q,Second,woman,False,NaN,Queenstown,yes,True
219,0,2,male,30.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True

Get Single Passenger

In [11]:
titanic.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
4,0,3,male,35.0,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True

Get the passenger # 342's information

In [12]:
titanic.loc[342] # Since @ int in this case for index cal also use iloc[]

survived                 0
pclass                   2
sex                   male
age                   28.0
sibsp                    0
parch                    0
fare                  13.0
embarked                 S
class               Second
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 342, dtype: object

Was Passenger #121 an adult male?

In [13]:
# first checked the columns
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [14]:
titanic.loc[121, 'adult_male'] # or titanic.loc[121].adult_male

np.True_

What was the oldest passengers age?

In [15]:
titanic.age.max()

np.float64(80.0)

Get all statistics for the passenger ages

In [16]:
titanic.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

What are the ages and sex of passengers 123, 153, and 232

In [17]:
titanic.loc[[123, 153, 232], ['age', 'sex']]

      age     sex
123  32.5  female
153  40.5    male
232  59.0    male

Order the passengers descending by age and print the results

In [18]:
titanic.sort_values(by='age', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

Which passenger had an age of 14.5

In [19]:
titanic.loc[titanic.age == 14.5]
# Known as conditional selections
# This: titanic.age == 14.5 creates a bool value and when we return a bool arr to loc, will give val
# these bool arr are so tiny, that using them doesn't take a lot of mem!

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
111,0,3,female,14.5,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,no,False

What were all the unique ages of the passengers

In [20]:
titanic.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

How many different classes did the Titanic have?

In [21]:
# Can just use nunique; this counts the unique number without needing to use the len(titanic['class'].unique()) to get the count
titanic['class'].nunique()

3

How many Passengers were in each class?

In [22]:
titanic.groupby('class').size()

# Alternatively: titanic['class'].value_counts()

# Can also do .size() since this is a series now

# NOTE VALUE_COUNTS WILL IGNORE ALL NANS. TO GET A TRUE COUNT, USE GROUPBY

C:\Users\Drago\AppData\Local\Temp\ipykernel_24968\1331277213.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby('class').size()

class
First     216
Second    184
Third     491
dtype: int64

What are the top 5 ages?

In [23]:
titanic.age.value_counts().head()

age
24.0    30
22.0    27
18.0    26
28.0    25
30.0    25
Name: count, dtype: int64

What percent of the passengers are represented by the top 5 ages?

In [24]:
titanic.age.value_counts().head().sum() / len(titanic)

np.float64(0.14927048260381592)

Who was the youngest first class passenger

In [25]:
titanic.loc[titanic['class'] == 'First'].sort_values(by='age', ascending=True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False

In [26]:
# alternative if need to solve dynamically for changing data and just need the last value
# this solution will always give the lowest value for the age regardless if the data changes
titanic.loc[titanic['class'] == 'First'].age.min()

np.float64(0.92)

What was the average ticket price, the max ticket price, and the min ticket price

In [27]:
titanic.fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

How many passengers didn't pay for a ticket?

In [28]:
(titanic.fare == 0).sum()
# len(titanic.loc[titanic.fare == 0])

np.int64(15)

Assign the ticket prices high, mid, low for revenue. The category delimiters are the 1/3rd percentile and 2/3rd percentile

USE A FUNCTION

In [29]:
# Function that assigns the quartiles
low=titanic.fare.quantile(1/3)
high=titanic.fare.quantile(2/3)

def price_category(price) :
    '''
    Assigns a low, med, or high designation given the price of a ticket. The designations are based on percentiles.
    '''
    if price <= low :
        return 'Low'
    elif price <= high :
        return 'Med'
    else :
        return 'High'

In [30]:
fare_category=titanic.fare.apply(price_category)
fare_category

0       Low
1      High
2       Low
3      High
4       Low
       ...
886     Med
887    High
888     Med
889    High
890     Low
Name: fare, Length: 891, dtype: object

Get the counts given the fare categories

In [31]:
fare_category.value_counts()

fare
Low     308
High    295
Med     288
Name: count, dtype: int64

Who was more likely to die, people traveling alone or people traveling with others

In [32]:
# Checked missing data
titanic.alone.unique()
titanic.survived.unique()

array([0, 1])

In [33]:
alone_survived=titanic.groupby(['survived', 'alone']).size().unstack(fill_value=0)
alone_survived

alone     False  True
survived
0           175    374
1           179    163

In [34]:
titanic.groupby('alone').get_group(True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [35]:
# get the totals
titanic.alone.value_counts()

alone
True     537
False    354
Name: count, dtype: int64

In [36]:
alone_survived.loc[1] / titanic.alone.value_counts().sort_index()

alone
False    0.505650
True     0.303538
dtype: float64

In [37]:
# This will create dataframes for each group

In [38]:
titanic.groupby('alone')['survived'].mean()

alone
False    0.505650
True     0.303538
Name: survived, dtype: float64

of the five people with the most expensive tickets, how many survived, what class were they in, and how much did they pay?

In [39]:
exp_tickets=titanic.fare.sort_values(ascending=False).head(10)

In [40]:
# This doesn't make sense since this is using one df to query another df so fixed it
# titanic.loc[exp_tickets.index, ['survived', 'class', 'fare']]
# Fixed the answer to not query a df with another df
exp_tickets[['survived', 'class', 'fare']]

KeyError: "None of [Index(['survived', 'class', 'fare'], dtype='object')] are in the [index]"

What's the total cost of all passenger tickets

In [ ]:
# This is using the sum function available to pandas Series
titanic.fare.sum()

np.float64(28693.9493)

The oldest passenger was 80, what class did they belong to

In [ ]:
titanic.loc[titanic.age == titanic.age.max()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0,S,First,man,True,A,Southampton,yes,True

What was the oldest passengers ID?

In [ ]:
titanic.age.idxmax()

630

Create a series for ticket price with a name

In [ ]:
fare_series=pd.Series(titanic.fare, name='Ticket Prices')

What is the data type for the series ticket price?

In [ ]:
fare_series.dtype

dtype('float64')

How Many people in each class survived and what percentages in each class survived?

In [ ]:
survival = titanic.groupby(['survived', 'class']).size().unstack(fill_value=0)
survival.loc[1] / survival.sum()

C:\Users\Drago\AppData\Local\Temp\ipykernel_15404\1622123742.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival = titanic.groupby(['survived', 'class']).size().unstack(fill_value=0)

class
First     0.629630
Second    0.472826
Third     0.242363
dtype: float64